app/Controllers/AntrianController.php

    public function index()
    {
        $model = new AntrianModel();
        $today = date('Y-m-d');

        // Hitung jumlah antrian per kategori HARI INI
        $data['antrian'] = [
            'mahasiswa' => $model->where('kategori', 'mahasiswa')
                                 ->where('DATE(waktu_antrian)', $today)
                                 ->countAllResults(),

            'umum' => $model->where('kategori', 'umum')
                            ->where('DATE(waktu_antrian)', $today)
                            ->countAllResults(),

            'dosen' => $model->where('kategori', 'dosen')
                             ->where('DATE(waktu_antrian)', $today)
                             ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `antrian`
WHERE `kategori` = 'umum'
AND DATE(waktu_antrian) = '2025-06-24'
SELECT COUNT(*) AS `numrows`
FROM `antrian`
WHERE `kategori` = 'dosen'
AND DATE(waktu_antrian) = '2025-06-24'

    public function ambil($kategori)
    {
        $allowed = ['mahasiswa', 'umum', 'dosen'];

        // Validasi kategori
        if (!in_array($kategori, $allowed)) {
            return redirect()->back()->with('error', 'Kategori tidak valid.');
        }

        $model = new AntrianModel();
        $today = date('Y-m-d');

        // Hitung nomor antrian HARI INI berdasarkan kategori
        $nomorAntrian = $model->where('kategori', $kategori)
                              ->where('DATE(waktu_antrian)', $today)
                              ->countAllResults() + 1;

        // Simpan ke database
        $data = [
            'kategori'      => $kategori,
            'waktu_antrian' => date('Y-m-d H:i:s'),
            'nomor_antrian' => $nomorAntrian,
            'status'        => 'menunggu', // opsional, jika kamu pakai kolom status
        ];

        if ($model->save($data)) {
---
SELECT COUNT(*) AS `numrows`
FROM `antrian`
WHERE `kategori` = 'mahasiswa'
AND DATE(waktu_antrian) = '2025-06-24'
INSERT INTO `antrian` (`kategori`, `waktu_antrian`, `nomor_antrian`, `status`, `created_at`, `updated_at`) VALUES ('mahasiswa', '2025-06-24 05:47:16', 1, 'menunggu', '2025-06-24 05:47:16', '2025-06-24 05:47:16')