app/Controllers/KepalaController.php

SELECT *
FROM `kepuasan_layanan`
ORDER BY `created_at` DESC
---
    public function rekap_kepuasan()
    {
        if (!$this->isKepala()) {
            return redirect()->to('/kepala/login');
        }

        $start = $this->request->getGet('start');
        $end   = $this->request->getGet('end');

        $builder = $this->db->table('kepuasan_layanan');

        if ($start && $end) {
            try {
                $builder->where('DATE(created_at) >=', date('Y-m-d', strtotime($start)))
                        ->where('DATE(created_at) <=', date('Y-m-d', strtotime($end)));
            } catch (\Exception $e) {
                return redirect()->back()->with('error', 'Format tanggal tidak valid.');
            }
        }

        $builder->orderBy('created_at', 'DESC');
        $data = $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `antrian`
SELECT COUNT(*) AS `numrows`
FROM `antrian`
LEFT JOIN `users` ON `users`.`id` = `antrian`.`id_cs_plt`
LEFT JOIN `pengunjung` ON `pengunjung`.`id` = `antrian`.`id_pengunjung`
LEFT JOIN `layanan` ON `layanan`.`id_layanan` = `antrian`.`id_layanan`
SELECT `antrian`.*, `users`.`username` AS `nama_cs`, `pengunjung`.`pengguna`, `pengunjung`.`nim`, `pengunjung`.`nidn`, `pengunjung`.`nik`, `layanan`.`layanan` AS `nama_layanan`
FROM `antrian`
LEFT JOIN `users` ON `users`.`id` = `antrian`.`id_cs_plt`
LEFT JOIN `pengunjung` ON `pengunjung`.`id` = `antrian`.`id_pengunjung`
LEFT JOIN `layanan` ON `layanan`.`id_layanan` = `antrian`.`id_layanan`
ORDER BY `antrian`.`created_at` DESC
 LIMIT 10
---
    public function rekap_antrian()
    {
        if (!$this->isKepala()) {
            return redirect()->to('/kepala/login');
        }

        $start     = $this->request->getGet('start');
        $end       = $this->request->getGet('end');
        $perPage   = (int)($this->request->getGet('perPage') ?? 10);
        $page      = (int)($this->request->getVar('page') ?? 1);

        $builder = $this->antrianModel->select('antrian.*, users.username AS nama_cs, pengunjung.nim')
    ->join('users', 'users.id = antrian.id_cs_plt', 'left')
    ->join('pengunjung', 'pengunjung.id = antrian.id_pengunjung', 'left');

        if ($start && $end) {
            try {
                $builder->where('DATE(antrian.created_at) >=', date('Y-m-d', strtotime($start)))
                        ->where('DATE(antrian.created_at) <=', date('Y-m-d', strtotime($end)));
            } catch (\Exception $e) {
                return redirect()->back()->with('error', 'Format tanggal tidak valid.');
            }
        }

        $laporan = $builder->orderBy('antrian.created_at', 'DESC')
                           ->paginate($perPage, 'default', $page);

        return view('kepala/rekap_antrian', [
            'laporan'     => $laporan,
            'pager'       => $this->antrianModel->pager,
            'perPage'     => $perPage,
            'currentPage' => $page,
            'totalData'   => $this->antrianModel->countAllResults(false),
            'start'       => $start,
            'end'         => $end
        ]);