app/Controllers/KepalaController.php

SELECT *
FROM `users`
WHERE `username` = 'azzy'
 LIMIT 1
---
    public function proses_login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();

SELECT DISTINCT `nama`
FROM `cs_plt`
ORDER BY `nama` ASC
---
    $data = $builder->get()->getResultArray();

    // Ambil daftar nama CS unik dari cs_plt
    $listCS = $this->db->table('cs_plt')
        ->select('nama')
        ->distinct()
        ->orderBy('nama', 'ASC')
        ->get()
        ->getResultArray();