app/Controllers/KepuasanController.php

    public function simpan()
    {
        $nomorAntrian = trim($this->request->getPost('nomor_antrian'));
        $penilaian    = (int) $this->request->getPost('penilaian');
        $saran        = htmlentities(trim($this->request->getPost('saran')));

        // Validasi input
        if (empty($nomorAntrian) || $penilaian < 1 || $penilaian > 5) {
            return redirect()->back()->withInput()->with('error', 'Nomor antrian dan penilaian wajib diisi dengan benar.');
        }

        $antrianModel     = new AntrianModel();
        $csPltModel       = new CsPltModel();
        $pengunjungModel  = new PengunjungModel();
        $kepuasanModel    = new KepuasanModel();

        // Cari data antrian berdasarkan nomor antrian dan status selesai
        $antrian = $antrianModel
            ->where('nomor_antrian', $nomorAntrian)
            ->where('status', 'selesai')
            ->orderBy('id', 'desc')
            ->first();

        if (!$antrian) {
            return redirect()->back()->withInput()->with('error', 'Nomor antrian tidak valid atau belum selesai dilayani.');
        }

        // Ambil data pengunjung jika ada
        $pengunjung = $antrian['id_pengunjung'] ? $pengunjungModel->find($antrian['id_pengunjung']) : null;

        // Ambil nama CS dari tabel cs_plt
        $cs = $csPltModel->find($antrian['id_cs_plt']);
---
SELECT *
FROM `antrian`
WHERE `nomor_antrian` = '3'
AND `status` = 'selesai'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `pengunjung`
WHERE `pengunjung`.`id` = '139'
SELECT *
FROM `cs_plt`
WHERE `cs_plt`.`id_cs_plt` = '15'