app/Controllers/LayarController.php

SELECT *
FROM `antrian`
WHERE `kategori` = 'mahasiswa'
AND DATE(created_at) = '2025-07-08'
AND `status` IN ('dipanggil','dilayani')
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `antrian`
WHERE `kategori` = 'umum'
AND DATE(created_at) = '2025-07-08'
AND `status` IN ('dipanggil','dilayani')
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `antrian`
WHERE `kategori` = 'dosen'
AND DATE(created_at) = '2025-07-08'
AND `status` IN ('dipanggil','dilayani')
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function index()
    {
        $today = date('Y-m-d');

        $mahasiswa = $this->antrianModel
            ->where('kategori', 'mahasiswa')
            ->where('DATE(created_at)', $today)
            ->whereIn('status', ['dipanggil', 'dilayani'])
            ->orderBy('created_at', 'DESC')
            ->first();

        $umum = $this->antrianModel
            ->where('kategori', 'umum')
            ->where('DATE(created_at)', $today)
            ->whereIn('status', ['dipanggil', 'dilayani'])
            ->orderBy('created_at', 'DESC')
            ->first();

        $dosen = $this->antrianModel
            ->where('kategori', 'dosen')
            ->where('DATE(created_at)', $today)
            ->whereIn('status', ['dipanggil', 'dilayani'])
            ->orderBy('created_at', 'DESC')
            ->first();