app/Controllers/LayananController.php

INSERT INTO `layanan` (`layanan`, `created_at`) VALUES ('kp_ta', '2025-06-24 05:47:14')
---
    public function simpan()
    {
        $model = new LayananModel();

        $layanan = $this->request->getPost('layanan');
        $layananLain = $this->request->getPost('layanan_lain');

        $data = [
            'layanan' => $layanan ?: $layananLain,
            'created_at' => date('Y-m-d H:i:s'),
        ];

        $model->insert($data);