app/Controllers/PanggilanController.php

    public function index()
    {
        $todayStart = date('Y-m-d 00:00:00');
        $todayEnd   = date('Y-m-d 23:59:59');

        $belumDipanggil = $this->antrianModel
            ->where('created_at >=', $todayStart)
            ->where('created_at <=', $todayEnd)
            ->where('status', 'menunggu')
            ->orderBy('created_at', 'ASC')
            ->findAll();

        $sudahDipanggil = $this->antrianModel
            ->where('created_at >=', $todayStart)
            ->where('created_at <=', $todayEnd)
            ->whereIn('status', ['dipanggil', 'dilayani', 'selesai'])
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `antrian`
WHERE `created_at` >= '2025-07-01 00:00:00'
AND `created_at` <= '2025-07-01 23:59:59'
AND `status` = 'menunggu'
ORDER BY `created_at` ASC
SELECT *
FROM `antrian`
WHERE `created_at` >= '2025-07-01 00:00:00'
AND `created_at` <= '2025-07-01 23:59:59'
AND `status` IN ('dipanggil','dilayani','selesai')
ORDER BY `created_at` ASC

    public function panggil($id)
    {
        // Validasi data jika perlu
        $data = $this->antrianModel->find($id);
        if (!$data) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        $this->antrianModel->update($id, [
            'status' => 'dipanggil',
        ]);
---
SELECT *
FROM `antrian`
WHERE `antrian`.`id` = '172'
UPDATE `antrian` SET `status` = 'dipanggil', `updated_at` = '2025-06-24 05:48:28'
WHERE `antrian`.`id` IN ('172')

    public function mulaiLayanan($id)
    {
        $data = $this->antrianModel->find($id);
        if (!$data) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        $updateData = [
            'status' => 'dilayani',
            'waktu_mulai' => Time::now('Asia/Jakarta'),
            'id_cs_plt' => session()->get('id_user') // Ambil ID CS dari session
        ];

        // Optional: jika created_at kosong, isi dengan sekarang
        if (empty($data['created_at'])) {
            $updateData['created_at'] = Time::now('Asia/Jakarta');
        }

        $this->antrianModel->update($id, $updateData);
---
SELECT *
FROM `antrian`
WHERE `antrian`.`id` = '192'
UPDATE `antrian` SET `status` = 'dilayani', `waktu_mulai` = '2025-07-01 13:57:30', `updated_at` = '2025-07-01 06:57:30'
WHERE `antrian`.`id` IN ('192')