app/Controllers/PengunjungController.php

INSERT INTO `pengunjung` (`pengguna`, `created_at`, `nidn`, `prodi`) VALUES ('dosen', '2025-07-08 08:51:37', '43234', 'Teknik Sipil-D4')
---
    public function submit()
    {
        $model = new PengunjungModel();

        // Ambil data dari form
        $pengguna = $this->request->getPost('pengguna');
        $prodi = $this->request->getPost('prodi');
        $createdAt = date('Y-m-d H:i:s');

        // Siapkan array data dasar
        $data = [
            'pengguna'   => $pengguna,
            'created_at' => $createdAt,
        ];

        // Tambah identitas berdasarkan kategori
        if ($pengguna === 'mahasiswa') {
            $data['nim'] = $this->request->getPost('nim');
            $data['prodi'] = $prodi;
        } elseif ($pengguna === 'dosen') {
            $data['nidn'] = $this->request->getPost('nidn');
            $data['prodi'] = $prodi;
        } elseif ($pengguna === 'umum') {
            $data['nik'] = $this->request->getPost('nik');
            // prodi tidak perlu disimpan
        }

        // Simpan data ke database
        $model->insert($data);