app/Models/AntrianModel.php

SELECT COUNT(*) AS `numrows`
FROM `antrian`
WHERE DATE(created_at) = '2025-07-14'
---
    public function getJumlahAntrianHariIni()
    {
        return $this->where('DATE(created_at)', date('Y-m-d'))->countAllResults();

SELECT *
FROM `antrian`
ORDER BY `waktu_antrian` DESC
 LIMIT 1
---
    public function getAntrianSedangDipanggil()
    {
        $antrian = $this->orderBy('waktu_antrian', 'DESC')->first();

SELECT `kategori`, COUNT(*) as total
FROM `antrian`
WHERE DATE(created_at) = '2025-07-08'
GROUP BY `kategori`
---
    public function getJumlahLayananHariIni()
    {
        return $this->select('kategori, COUNT(*) as total')
            ->where('DATE(created_at)', date('Y-m-d'))
            ->groupBy('kategori')
            ->findAll();